#include "ListNode.h"

void menu()
{
	cout << "**********************************" << endl;
	cout << "********** 1、 创建链表 **********" << endl;
	cout << "********** 2、 插入结点 **********" << endl;
	cout << "********** 3、 反转链表 **********" << endl;
	cout << "********** 4、 输出链表 **********" << endl;
	cout << "********** 5、 删除结点 **********" << endl;
	cout << "********** 6、 链表中点 **********" << endl;
	cout << "********** 7、 是否成环 **********" << endl;
	cout << "********** 8、 奇偶调换 **********" << endl;
	cout << "********** 9、 查找结点 **********" << endl;
	cout << "********** 10、退出系统 **********" << endl;
}