//
// Created by k on 25-3-29.
//

#ifndef MENU_H
#define MENU_H

#include <iostream>
using namespace std;
class Menu
{
public:
     static void menu()
     {
               cout << "*********************************************************************************************" << endl;
               cout << "*        1、生成10000个测试数据        *             *        2、生成50000个测试数据        *" << endl;
               cout << "*        3、生成200000个测试数据       *             *        4、生成100个数据*100k次       *" << endl;
               cout << "*        5、使用插入排序               * 13.退出系统 *        6、使用快速排序               *" << endl;
               cout << "*        7、使用归并排序               *  ---------  *        8、使用计数排序               *" << endl;
               cout << "*        9、使用基数排序               *             *        10、保存文件                  *" << endl;
               cout << "*        11、读取文件                  *             *        12、清空数据                  *" << endl;
               cout << "*********************************************************************************************" << endl;
     }
};



#endif //MENU_H
